üìç Î≥∏ ÎÖ∏Ìä∏Î∂Å ÎÇ¥Ïö©ÏùÄ Ïù∏ÌîÑÎü∞ Í∞ïÏùò `ÌååÏù¥Ïç¨(Python)ÏúºÎ°ú Îç∞Ïù¥ÌÑ∞ Í∏∞Î∞ò Ï£ºÏãù ÌÄÄÌä∏ Ìà¨ÏûêÌïòÍ∏∞ Part1`Î•º ÌïôÏäµÌïòÍ≥† Ï†ïÎ¶¨Ìïú ÎÇ¥Ïö©ÏûÑÏùÑ Î∞ùÌûôÎãàÎã§.

In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

**Pandas version 0.25.1 (`pip install pandas==0.25.1`)**

# `Series` Data type

-  Numpy's ndarray + Ïà´ÏûêÍ∞Ä ÏïÑÎãå Îã§Î•∏ typeÏùò index (E.g. Î¨∏ÏûêÏó¥)
-  SeriesÎäî numpy Wrapper (numpyÎ•º ÌïúÎ≤à Í∞êÏã∏ÏÑú, numpyÏùò Í∏∞Îä• + Î∂ÄÍ∞Ä Í∏∞Îä•ÏùÑ Ï∂îÍ∞ÄÌïú Í≤É)

In [2]:
import pandas as pd

In [3]:
a = pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

SeriesÎäî listÍ∞Ä ÏÑ∏Î°úÎ°ú ÎßåÎì§Ïñ¥ÏßÑ ÌòïÌÉúÎùºÍ≥† ÏÉùÍ∞ÅÌïòÎ©¥ ÎêúÎã§

In [5]:
# SeriesÎ•º ÏÉùÏÑ±ÌïòÎäî Ï≤´Î≤àÏß∏ Î∞©Î≤ï
s2 = pd.Series(
    [1, 2, 3, 4],
    index=['a', 'b', 'c', 'd']  # SeriesÏóêÏÑú indexÎ•º Îî∞Î°ú ÏßÄÏ†ïÌï† Ïàò ÏûàÎã§.
)
s2

a    1
b    2
c    3
d    4
dtype: int64

In [6]:
s2.head(2)

a    1
b    2
dtype: int64

In [7]:
# ÎëêÎ≤àÏß∏Î∞©Î≤ï
s2 = pd.Series({'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5})
s2.head()

a    1
b    2
c    3
d    4
e    5
dtype: int64

- SeriesÍ∞Ä indexÎ•º Í∞ÄÏßÄÍ≥† ÏûàÍ∏∞ ÎïåÎ¨∏Ïóê dictionary ÌòïÌÉúÏ≤òÎüº Î≥¥Ïùº Ïàò ÏûàÏúºÎØÄÎ°ú, Series ÏÉùÏÑ± ÏãúÏóê dictionary Ï≤òÎüº ÎßåÎì§Ïñ¥ Ï§ÑÏàòÎèÑ ÏûàÎã§.
- ÌïúÍ∞ÄÏßÄ data typeÎßå Í∞ÄÏßÄÍ≥† ÏûàÏùÑ Ïàò ÏûàÏùå

## `nan`Í≥º Í¥ÄÎ†®Îêú Ìï®Ïàò

In [8]:
import numpy as np

In [10]:
np.nan  # Í∞íÏù¥ ÏïÑÎ¨¥Í≤ÉÎèÑ ÏóÜÎäî Í∞í

nan

In [11]:
s = pd.Series([10, 0, 1, 1, 2, 3, 4, 5, 6, np.nan])  # NaN : float64
s

0    10.0
1     0.0
2     1.0
3     1.0
4     2.0
5     3.0
6     4.0
7     5.0
8     6.0
9     NaN
dtype: float64

In [12]:
len(s)
s.shape
s.count()    # not count `nan`

10

(10,)

9

In [13]:
s.unique()

# ÏàòÏóÖÏóêÏÑúÎäî Îã§Î£®ÏßÄ ÏïäÏïòÏßÄÎßå, nunique()Îäî uniqueÌïú Í∞íÎì§Ïùò Ï¥ù Í∞ØÏàòÎ•º ÏïåÎ†§Ï£ºÎäî Ìï®ÏàòÏûÖÎãàÎã§.
# s.nunique()

array([10.,  0.,  1.,  2.,  3.,  4.,  5.,  6., nan])

In [14]:
s.nunique()

8

In [16]:
s.value_counts()  # not count `nan`

1.0     2
0.0     1
6.0     1
4.0     1
2.0     1
10.0    1
5.0     1
3.0     1
dtype: int64

- Ïù¥ Ïô∏Ïùò Ìï®ÏàòÎì§Ïóê ÎåÄÌï¥ÏÑúÎäî Ïù¥ÌõÑ ÏàòÏóÖÏóêÏÑú ÌïòÎÇòÏî© Îã§Î£∞ ÏòàÏ†ï!

## index labelÏùÑ Í∏∞Ï§ÄÏúºÎ°ú SeriesÍ∞ÑÏóê operationÏù¥ ÏùºÏñ¥ÎÇ®

- DataÏùò 'ÏàúÏÑú'Í∞Ä ÏïÑÎãàÎùº index labelÏù¥ ÏûêÎèôÏúºÎ°ú Ï†ïÎ†¨ÎêòÏñ¥ Ïó∞ÏÇ∞Ïù¥ ÏßÑÌñâÎê®! (ÎèôÏùºÌïú indexÎÅºÎ¶¨ Ïó∞ÏÇ∞Ïù¥ ÎêúÎã§Îäî ÏùòÎØ∏)

In [17]:
s3 = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
s4 = pd.Series([4, 3, 2, 1], index=['d', 'c', 'b', 'a'])

In [20]:
s3
s4

a    1
b    2
c    3
d    4
dtype: int64

d    4
c    3
b    2
a    1
dtype: int64

In [18]:
s3 + s4

a    2
b    4
c    6
d    8
dtype: int64

# `DataFrame` Data type

- Îã§ÏàòÏùò SeriesÎ•º ÌïòÎÇòÏùò Î≥ÄÏàòÎ°ú Í¥ÄÎ¶¨Ìï† Ïàò ÏûàÎèÑÎ°ù ÎßåÎì† ÏûêÎ£åÌòï
    - SeriesÏùò dict ÌòïÌÉúÎùºÍ≥† Î≥¥Î©¥Îê® __(ÏóëÏÖÄÏùò tableÍ≥º Ïú†ÏÇ¨Ìïú ÌòïÌÉú)__
        - `{'Ïª¨ÎüºÎ™Ö1': Series1, 'Ïª¨ÎüºÎ™Ö2': Series2}`
        - Í∞Å SeriesÎäî DataFrameÏùò columnÏùÑ Ïù¥Î£∏
        - ÎãπÏó∞Ìûà DataFrameÏùÑ Ïù¥Î£®Îäî SeriesÍ∞ÑÏùò indexÎäî ÏÑúÎ°ú Îã§ Í∞ôÏùå! => ÎèôÏùº index ÏÇ¨Ïö©

## DataFrameÏùÑ ÎßåÎìúÎäî Îã§ÏñëÌïú Î∞©Î≤ïÎì§

In [23]:
s1 = np.arange(1, 6, 1)  # 1Ïù¥ÏÉÅ 6ÎØ∏Îßå Ïà´ÏûêÎ•º 1Ïî© Ï¶ùÍ∞ÄÏãúÏºúÏÑú ÏÉùÏÑ±ÌïúÎã§.
s2 = np.arange(6, 11, 1)
s1
s2

array([1, 2, 3, 4, 5])

array([ 6,  7,  8,  9, 10])

In [24]:
df = pd.DataFrame(
    {
        'c1': s1,
        'c2': s2
    }
)
df

   c1  c2
0   1   6
1   2   7
2   3   8
3   4   9
4   5  10

In [26]:
# 1Î≤àÏß∏ Î∞©Î≤ï  (Default index and columns would be set)
pd.DataFrame(
    [
        [10,11],
        [10,12]
    ]
)  # 2Ï∞®Ïõê list ÌòïÌÉúÎ°ú ÏÉùÏÑ±
pd.DataFrame(
    np.array(
        [
            [10, 11],
            [20, 21]
        ]
    )
)  # numpy array ÌòïÌÉúÎ°ú ÏÉùÏÑ±

    0   1
0  10  11
1  10  12

    0   1
0  10  11
1  20  21

In [27]:
# 2Î≤àÏß∏ Î∞©Î≤ï (ÎßéÏù¥ ÏïàÏì∞ÏûÑ)
pd.DataFrame(
    [
        pd.Series(np.arange(10, 15)),   # Íµ≥Ïù¥ SeriesÍ∞Ä ÏïÑÎãàÍ≥† listÌòïÌÉúÏù¥Í∏∞Îßå ÌïòÎ©¥ Îê®(=iterableÌïú objectÎ©¥ Îã§ Í∞ÄÎä•)
        pd.Series(np.arange(15, 20)),   # Íµ≥Ïù¥ SeriesÍ∞Ä ÏïÑÎãàÍ≥† listÌòïÌÉúÏù¥Í∏∞Îßå ÌïòÎ©¥ Îê®(=iterableÌïú objectÎ©¥ Îã§ Í∞ÄÎä•)
    ]
)

pd.DataFrame(
    [
        np.arange(10, 15),
        np.arange(15, 20),
    ]
)

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [28]:
# 3Î≤àÏß∏ Î∞©Î≤ï (with column & index names)
pd.DataFrame(
    np.array(
        [
            [10, 11],
            [20, 21]
        ]
    ), 
    columns=['a', 'b'],
    index=['r1', 'r2']
)

     a   b
r1  10  11
r2  20  21

In [29]:
# 4Î≤àÏß∏ Î∞©Î≤ï
s1 = pd.Series(np.arange(1, 6, 1))    # Íµ≥Ïù¥ SeriesÍ∞Ä ÏïÑÎãàÍ≥† listÌòïÌÉúÏù¥Í∏∞Îßå ÌïòÎ©¥ Îê®(=iterableÌïú objectÎ©¥ Îã§ Í∞ÄÎä•)
s2 = pd.Series(np.arange(6, 11, 1))   # Íµ≥Ïù¥ SeriesÍ∞Ä ÏïÑÎãàÍ≥† listÌòïÌÉúÏù¥Í∏∞Îßå ÌïòÎ©¥ Îê®(=iterableÌïú objectÎ©¥ Îã§ Í∞ÄÎä•)
pd.DataFrame(
    {
        'c1': [1,2,3],    # list, np.array, Series Ï†ÑÎ∂Ä Îã§ Ïò¨ Ïàò ÏûàÏùå!
        'c2': [4,5,6]
    }
)

   c1  c2
0   1   4
1   2   5
2   3   6

In [30]:
# Ï∞∏Í≥†: 1Ï§ÑÏßúÎ¶¨ ÎßåÎì§ ÎïåÎèÑ dictionaryÏùò valueÏóê Ìï¥ÎãπÌïòÎäî Í∞íÎì§ÏùÄ iterableÌïú data type(e.g. list, np.array, Series Îì±)ÏúºÎ°ú ÏÑ§Ï†ïÌï¥Ï§òÏïºÌï®
pd.DataFrame({'c1': [0], 'c2': [1]})

   c1  c2
0   0   1

In [32]:
s1 = pd.Series(np.arange(1, 6, 1), index=['a', 'b', 'c', 'd', 'e'])
s2 = pd.Series(np.arange(6, 11, 1), index=['b', 'c', 'd', 'f', 'g'])
df = pd.DataFrame(
    {
        'c1': s1,
        'c2': s2
    }
)
df

    c1    c2
a  1.0   NaN
b  2.0   6.0
c  3.0   7.0
d  4.0   8.0
e  5.0   NaN
f  NaN   9.0
g  NaN  10.0

## DataFrame ÏÉùÏÑ±Ïãú, SeriesÍ∞ÑÏóê Index Í∏∞Ï§ÄÏúºÎ°ú ÏûêÎèôÏ†ïÎ†¨!

In [33]:
s1 = pd.Series(np.arange(1, 6, 1))
s2 = pd.Series(np.arange(6, 11, 1))
s3 = pd.Series(np.arange(12, 15), index=[1, 2, 10])  # this one has index values unlike s1, s2
s1
s2
s3

0    1
1    2
2    3
3    4
4    5
dtype: int32

0     6
1     7
2     8
3     9
4    10
dtype: int32

1     12
2     13
10    14
dtype: int32

In [34]:
df = pd.DataFrame({'c1': s1, 'c2': s2, 'c3': s3}) 
df

     c1    c2    c3
0   1.0   6.0   NaN
1   2.0   7.0  12.0
2   3.0   8.0  13.0
3   4.0   9.0   NaN
4   5.0  10.0   NaN
10  NaN   NaN  14.0

## DataFrameÏóê ÏÉàÎ°úÏö¥ column Ï∂îÍ∞ÄÌïòÍ∏∞

In [36]:
# my_dict['a'] = 1

In [37]:
df['c4'] = pd.Series([1,2,3,4], index=[0, 1, 2, 10])

In [38]:
df

     c1    c2    c3   c4
0   1.0   6.0   NaN  1.0
1   2.0   7.0  12.0  2.0
2   3.0   8.0  13.0  3.0
3   4.0   9.0   NaN  NaN
4   5.0  10.0   NaN  NaN
10  NaN   NaN  14.0  4.0

## Reindexing

- ÏÉàÎ°úÏö¥ index labelÏùÑ Í∏∞Î∞òÏúºÎ°ú Í∏∞Ï°¥Ïùò "index-value" mappingÏùÄ Ïú†ÏßÄÌïúÏ±Ñ Ïû¨Î∞∞Ïó¥ÌïòÎäî Í≤É

### Ï∞∏Í≥†: index ÏûêÏ≤¥Î•º Î∞îÍæ∏Îäî Í≤É("index-value" mappingÏù¥ Íπ®Ïßê)

In [39]:
s = pd.Series([1,2,3,4,5])
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [41]:
# index Î≥ÄÍ≤Ω
s.index = ['a', 'b', 'c', 'd', 'e']
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

### Ï∞∏Í≥† :  `set_index()` : ÌäπÏ†ï columnÏùÑ indexÎ°ú ÎßåÎì¶

In [42]:
# ÏúÑÏùò 'DataFrame ÏÉùÏÑ±Ïãú, SeriesÍ∞ÑÏóê Index Í∏∞Ï§ÄÏúºÎ°ú ÏûêÎèôÏ†ïÎ†¨!' Ï±ïÌÑ∞ÏóêÏÑú Ï†ïÏùòÌïú dataframeÏûÖÎãàÎã§
df

     c1    c2    c3   c4
0   1.0   6.0   NaN  1.0
1   2.0   7.0  12.0  2.0
2   3.0   8.0  13.0  3.0
3   4.0   9.0   NaN  NaN
4   5.0  10.0   NaN  NaN
10  NaN   NaN  14.0  4.0

In [43]:
df['c5'] = pd.Series([1,2,3,4,5,6], index=[0,1,2,3,4,10])
df

     c1    c2    c3   c4  c5
0   1.0   6.0   NaN  1.0   1
1   2.0   7.0  12.0  2.0   2
2   3.0   8.0  13.0  3.0   3
3   4.0   9.0   NaN  NaN   4
4   5.0  10.0   NaN  NaN   5
10  NaN   NaN  14.0  4.0   6

In [44]:
df.set_index("c5")  # 'c5'Î•º Ïù∏Îç±Ïä§Î°ú ÏßÄÏ†ïÌïúÎã§.

     c1    c2    c3   c4
c5
1   1.0   6.0   NaN  1.0
2   2.0   7.0  12.0  2.0
3   3.0   8.0  13.0  3.0
4   4.0   9.0   NaN  NaN
5   5.0  10.0   NaN  NaN
6   NaN   NaN  14.0  4.0

### Reindex (Ïù¥Í≤å ÏßÑÏßú!!!)

In [46]:
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [45]:
s2 = s.reindex(
    ['a', 'c', 'e', 'g']
)
s2

a    1.0
c    3.0
e    5.0
g    NaN
dtype: float64

In [47]:
# Copied
s2['a'] = 0
s2

a    0.0
c    3.0
e    5.0
g    NaN
dtype: float64

In [ ]:
# sÎäî s2Ïùò Í∞íÏùÑ Î∞îÍøîÎèÑ Ïïà Í±¥ÎìúÎ†§Ïßê
s

In [48]:
# [X] Ïù¥Î†áÍ≤å ÌïòÎ©¥ ÏïàÎê®
s1 = pd.Series([0, 1, 2], index=[0, 1, 2])
s2 = pd.Series([3, 4, 5], index=['0', '1', '2'])
s1
s2

0    0
1    1
2    2
dtype: int64

0    3
1    4
2    5
dtype: int64

In [49]:
s1 + s2  # s1, s2Ïùò indexÍ∞Ä Îã§Î¶Ñ(Ïà´ÏûêÌòï vs. Î¨∏ÏûêÏó¥)

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [50]:
s1.index

Int64Index([0, 1, 2], dtype='int64')

In [51]:
s2.index

Index(['0', '1', '2'], dtype='object')

In [52]:
s2 = s2.reindex(s1.index)
s2

0   NaN
1   NaN
2   NaN
dtype: float64

In [53]:
# Ï≤´Î≤àÏß∏ Î∞©Î≤ï
s1 = pd.Series([0, 1, 2], index=[0, 1, 2])
s2 = pd.Series([3, 4, 5], index=['0', '1', '2'])

In [54]:
s2.index = s2.index.astype(int)

In [55]:
s2

0    3
1    4
2    5
dtype: int64

In [56]:
s2.index

Int64Index([0, 1, 2], dtype='int64')

In [57]:
s1 + s2

0    3
1    5
2    7
dtype: int64

In [58]:
# ÎëêÎ≤àÏß∏ Î∞©Î≤ï
s1 = pd.Series([0, 1, 2], index=[0, 1, 2])
s2 = pd.Series([3, 4, 5], index=['0', '1', '2'])

In [59]:
s1.index = ['a', 'b', 'c']
s2.index = ['a', 'b', 'c']

In [60]:
s1 + s2

a    3
b    5
c    7
dtype: int64

#### `reindex()`Ïùò Ïú†Ïö©Ìïú Arguments

- `fill_value`

In [61]:
s2 = s.copy()
s2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [62]:
s2.reindex(['a', 'f'])

a    1.0
f    NaN
dtype: float64

In [63]:
s2.reindex(['a', 'f'], fill_value=0)  # fill 0 insteand of Nan

a    1
f    0
dtype: int64

- `method`

In [64]:
s3 = pd.Series(['red', 'green', 'blue'], index=[0, 3, 5])
s3

0      red
3    green
5     blue
dtype: object

In [65]:
s3.reindex(np.arange(0,7))

0      red
1      NaN
2      NaN
3    green
4      NaN
5     blue
6      NaN
dtype: object

In [66]:
s3.reindex(np.arange(0,7), method='ffill')

0      red
1      red
2      red
3    green
4    green
5     blue
6     blue
dtype: object

#### ÏòàÏ†ú

In [ ]:
# Îß® Ï≤´ Í∞ïÏùòÏóêÏÑú ÎùºÏù¥Î∏åÎü¨Î¶¨Î•º ÏÑ§ÏπòÌï† Îïå requirements.txtÎ•º Ïù¥Ïö©Ìï¥ÏÑú ÏÑ§ÏπòÎ•º ÌñàÏúºÎ©¥, Í±¥ÎÑàÎõ∞ÏÖîÎèÑ Îê©ÎãàÎã§. 
!pip install finance_datareader == 0.9.1

In [68]:
import FinanceDataReader as fdr
fdr.__version__

'0.9.31'

In [69]:
# ÏÇºÏÑ±Ï†ÑÏûê
df1 = fdr.DataReader("005930", '2018-01-02', '2018-10-30')  # Ï¢ÖÎ™©ÏΩîÎìú, ÏãúÏûëÏùº, Ï¢ÖÎ£åÏùº ÏàúÏúºÎ°ú ÏûëÏÑ±

# KODEX 200 (ETF)
df2 = fdr.DataReader("069500", '2018-01-03', '2018-10-30')

In [70]:
df1.head(2)
df1.tail(2)

             Open   High    Low  Close  Volume    Change
Date
2018-01-02  51380  51400  50780  51020  169485  0.001177
2018-01-03  52540  52560  51420  51620  200270  0.011760

             Open   High    Low  Close    Volume    Change
Date
2018-10-29  40850  41950  40550  41400  14460521  0.009756
2018-10-30  41400  43000  41000  42350  14205190  0.022947

In [71]:
df2.head(2)
df2.tail(2)

             Open   High    Low  Close   Volume    Change
Date
2018-01-03  30443  30535  30370  30446  7238657  0.004255
2018-01-04  30618  30633  30195  30206  8899496 -0.007883

             Open   High    Low  Close   Volume    Change
Date
2018-10-29  24783  24947  24451  24499  5292654 -0.008097
2018-10-30  24465  24888  24376  24668  7997606  0.006898

In [72]:
# ÏÇºÏÑ±Ï†ÑÏûê
df1 = fdr.DataReader("005930", '2018-01-02', '2018-10-30')

# KODEX 200 (ETF)
df2 = fdr.DataReader("069500", '2018-01-02', '2018-10-30')

In [73]:
df1.shape
df2.shape

(202, 6)

(202, 6)

In [74]:
df2 = df2.drop(pd.to_datetime("2018-01-03"))
df2.head()

             Open   High    Low  Close   Volume    Change
Date
2018-01-02  30295  30384  30200  30317  5008027  0.004406
2018-01-04  30618  30633  30195  30206  8899496 -0.007883
2018-01-05  30282  30609  30282  30616  8108218  0.013573
2018-01-08  30738  30866  30568  30822  8010076  0.006729
2018-01-09  30729  30949  30563  30700  7957288 -0.003958

In [75]:
df1.head()

             Open   High    Low  Close  Volume    Change
Date
2018-01-02  51380  51400  50780  51020  169485  0.001177
2018-01-03  52540  52560  51420  51620  200270  0.011760
2018-01-04  52120  52180  50640  51080  233909 -0.010461
2018-01-05  51300  52120  51200  52120  189623  0.020360
2018-01-08  52400  52520  51500  52020  167673 -0.001919

In [76]:
new_df2 = df2.reindex(df1.index)
new_df2.head()

               Open     High      Low    Close     Volume    Change
Date
2018-01-02  30295.0  30384.0  30200.0  30317.0  5008027.0  0.004406
2018-01-03      NaN      NaN      NaN      NaN        NaN       NaN
2018-01-04  30618.0  30633.0  30195.0  30206.0  8899496.0 -0.007883
2018-01-05  30282.0  30609.0  30282.0  30616.0  8108218.0  0.013573
2018-01-08  30738.0  30866.0  30568.0  30822.0  8010076.0  0.006729

In [77]:
df1.shape
new_df2.shape

(202, 6)

(202, 6)

In [78]:
new_df2.fillna(method="ffill")

               Open     High      Low    Close      Volume    Change
Date
2018-01-02  30295.0  30384.0  30200.0  30317.0   5008027.0  0.004406
2018-01-03  30295.0  30384.0  30200.0  30317.0   5008027.0  0.004406
2018-01-04  30618.0  30633.0  30195.0  30206.0   8899496.0 -0.007883
2018-01-05  30282.0  30609.0  30282.0  30616.0   8108218.0  0.013573
2018-01-08  30738.0  30866.0  30568.0  30822.0   8010076.0  0.006729
...             ...      ...      ...      ...         ...       ...
2018-10-24  25765.0  25787.0  25457.0  25504.0  12077177.0 -0.005149
2018-10-25  24971.0  25107.0  24730.0  25097.0  11660441.0 -0.015958
2018-10-26  25121.0  25126.0  24474.0  24699.0   8216927.0 -0.015858
2018-10-29  24783.0  24947.0  24451.0  24499.0   5292654.0 -0.008097
2018-10-30  24465.0  24888.0  24376.0  24668.0   7997606.0  0.006898

[202 rows x 6 columns]